# Трябва да се напълни цистерна с вода. Имате 2 кофи с вместимост 2 и 3 литра
# и ги ползвате едновременно. Да се състави програма, която по въведен обем извежда
# как ще прелеете течността с тези кофи, т.е. по-колко пъти ще се пълни всяка от кофите.
# Входни данни: естествено число от интервала [10..9999].
# Използвайте проверка на логическо условие - оператор if.
# Пример: 107 Изход: 21 пъти 2-те кофи, допълнително кофа от 2 литра

try : # проверка за коректно въведено 4 цифрено естественочисло
    Obem_za_nalivane = (input('Въведете 4 цифрено естествено число в интервала [10..9999]='))
    int(Obem_za_nalivane)
    if len(Obem_za_nalivane)< 2 or len(Obem_za_nalivane)>4 :
        raise 
except :  
    print('Въвели сте неправилна стойност или число извън интервала [10..9999]')
    exit()

# Проверяваме обема за наливане колко пъти се дели на 2+3=5л и какъв е остатъка дали се дели на 3 или на 2
Ostatak = int(Obem_za_nalivane) % 5
Kofi_2_plus_3 = int(Obem_za_nalivane) // 5 # Целочислено деление на 5 
if Ostatak == 4 :
    print(f'{Kofi_2_plus_3} пъти 2-те кофи и 2 пъти допълнително кофа от 2 литра ')
elif Ostatak == 3 :
    print(f'{Kofi_2_plus_3} пъти 2-те кофи и допълнително кофа от 2 литра ')
elif Ostatak == 2 :
    print(f'{Kofi_2_plus_3} пъти 2-те кофи и 1 пъти допълнително кофа от 2 литра ')
elif Ostatak == 1 :
    print(f'{Kofi_2_plus_3} пъти 2-те кофи и 1 литър допълнително в кофа от 2 литра ')
else :
    print(f'{Kofi_2_plus_3} пъти 2-те кофи')

