# Преди доста години имаше услуга - изпращане на луксозна телеграма.
# Поводи най-различни: рожден, имен ден, сватба и т.н. Цената се формираше по следния
# начин А: цена за бланка, B: цена за текст до 20 думи, C: цена за всяка дума, след първите
# 20 думи. Стойностите на A, B, C са реални числа от интервала [0.02..0.89]. Да се състави
# програма, чрез която по въведени брой думи, стойности за A, B, брой думи, C се
# изчислява крайна цена на луксозна телеграма.
# Пример: A=0.2, B=0.5, 45 думи, C=0.05 Изход: 1.95

# Проверка за коректност на цена на бланката
try :
    Blank_price = float(input('Въведете цена на бланката в интервала [0.02 .. 0.89] ='))
    if Blank_price < 0.02 or Blank_price > 0.89 :
        raise()
except :
    print('Въвели сте некоректна стойност за цена на бланката в интервала [0.02 .. 0.89]')
    exit()

# Проверка за коректност на цена за текст до 20 думи
try :
    Price_for_text_to_20_words = float(input('Въведете на цена за текст до 20 думи в интервала [0.02 .. 0.89] ='))
    if Price_for_text_to_20_words < 0.02 or Price_for_text_to_20_words > 0.89 :
        raise()
except :
    print('Въвели сте некоректна стойност или число извън интервала [0.02 .. 0.89]')
    exit()

# Проверка за коректност на цена за текст за всяка дума след 20-тата дума
try :
    Text_price_for_each_word_after_the_20th = float(input('Въведете на цена за текст за всяка дума след 20-тата в интервала [0.02 .. 0.89] ='))
    if Text_price_for_each_word_after_the_20th < 0.02 or Text_price_for_each_word_after_the_20th > 0.89 :
        raise()
except :
    print('Въвели сте некоректна стойност или число извън интервала [0.02 .. 0.89]')
    exit()

# Проверка за коректност на Брой думи
try :
    word_count = int(input('Въведете брой думи за телеграмата в интервала [1 .. 1000] ='))
    if word_count < 1 or word_count > 1000 :
        raise()
except :
    print('Въвели сте некоректна стойност или число извън интервала [1 .. 1000]')
    exit()

if word_count <= 20 :
    word_count = 20

# Пресмятане на цената на телеграмата
telegram_price = Blank_price + Price_for_text_to_20_words + (word_count-20)*Text_price_for_each_word_after_the_20th
print(f'Цената на телеграмата е {telegram_price}')