# 8. Да се състави програма, която да отгатне колко е студено/топло по
# въведената температура в градус Целзий. Температурните интервали са: t <=-20 ледено
# студено; t <=0 && t>-20 студено; t <=15 && t>0 хладно; t <=25 && t>15 топло; t >25 горещо
# Входни данни: t - цяло число от интервала [-100..100].
# Пример: 12 Изход: хладно

try :
    degrees_Celsius = int(input('Въведете число за температурата по Целзий в интервала [-100 .. 100]='))
    if degrees_Celsius < -100 or degrees_Celsius > 100 :
        raise()
except :
    print('Въвели сте некоректна стойност за температурата или число извън диапазона [-100 .. 100]')
    exit()

if degrees_Celsius <= -20 :
    print('Времето е ледено студено')
elif degrees_Celsius <= 0 and degrees_Celsius > -20 :
    print('Времето е студено')
elif degrees_Celsius <= 15 and degrees_Celsius > 0 :
    print('Времето е хладно')
elif degrees_Celsius <= 25 and degrees_Celsius > 15 :
    print('Времето е топло')
else :
    print('Времето е горещо')
